# ЗАДАЧА №1
# number = input('Введите число: ')
# resualt = int(number) + 2
# print(resualt)

# number = int(input('Введите число: '))
# resualt = number + 2
# print(resualt)

# Задача №2
# num = int(input('Введите число: '))
# if num < 0:
#     print('Ввели не верное число, введите от 0 до 10')
# elif num > 10:
#     print('Ввели не верное число, введите от 0 до 10')
# else:
#     print('Число введено ВЕРНО в диапазоне от 0 до 10')
#     print('Введенное число в квадрате равно:', num**2)

# Задача №3
print('!!!!!!!!!!!!!!!МЕДИЦИНСКАЯ КАРТОЧКА!!!!!!!!!!!')
name = input('Введите имя: ')
suname = input('Введите фамилию: ')
age = int(input('Введите ваш возраст: '))
weight = int(input('Введите ваш вес: '))
